<h1>Data Preprocessing: Practice Room</h1>

Please install the following first:

In [ ]:
#pip install sqlalchemy

In [ ]:
#pip install ipython-sql

In [12]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [28]:
%%sql
sqlite:///../SoftDevEmployees.db

In [29]:
%%sql
SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///../SoftDevEmployees.db
   sqlite:///../Students.db
   sqlite:///../sales
   sqlite:///../sales.db
   sqlite:///../sales_db.db
   sqlite:///staff_db.db
Done.

[('Employees',)]

In [31]:
%%sql 

SELECT * FROM Employees LIMIT 10

 * sqlite:///../SoftDevEmployees.db
   sqlite:///../Students.db
   sqlite:///../sales
   sqlite:///../sales.db
   sqlite:///../sales_db.db
   sqlite:///staff_db.db
Done.

[('Dumisani', 'Thwala', None, 'Back-End Developer', 'Graduate', 52171, 'Web Applications'),
 ('Tony', 'Horn', 'Mr', 'Back-End Developer', 'Graduate', 103397, 'Mobile Applications'),
 ('Vuyokazi', 'barnes', 'Mr', 'Business Analyst', 'Graduate', 69220, 'Web Applications'),
 ('sello', 'Details', 'Mr', 'Database Analyst', 'Graduate', 54945, 'Mobile Applications'),
 ('Jacqueline', 'fredericks', None, 'Front-End Developer', 'Graduate', 51104, 'Web Applications'),
 ('Walter', 'Jansen', 'Mr', 'Front-End Developer', 'Graduate', 35454, 'Mobile Applications'),
 ('Ernest', 'maritz', None, 'Full-Stack Developer', 'Graduate', 88569, 'Web Applications'),
 ('Kevin', 'Motloung', 'MR', 'Systems Analyst', 'Graduate', 99370, 'Mobile Applications'),
 ('takalani', 'Richards', 'mr', 'Systems Analyst', 'Graduate', 57906, 'Web Applications'),
 ('Bronwyn', 'Swartz', None, 'UI/UX Developer', 'Graduate', 34350, 'Mobile Applications')]

<b>Question 1</b><br/><br/>
Given the Employees Table in the SoftDevEmployees database, generate a result set with the following columns and requirements:
<ul>
    <li>Title: Must be uniform (Mr, MR or mR must be normalised)</li>
    <li>Name: Must have not leading or trailing space - First letter must be in upper case</li>
    <li>Surname: Must have no leading or trailing spaces - First letter must be in upper case</li>
    <li>Gender: The gender must be inferred from the Title</li>
</ul>

Save the newly retrieved data into an excel sheet. Hint: Use Pandas export.

<b>Question 2</b><br/><br/>
Given the Employees Table in the SoftDevEmployees database, generate a result set with the following columns and requirements:
<ul>
    <li>Title: Must be uniform (Mr, MR or mR must be normalised)</li>
    <li>Name: Must have not leading or trailing space - First letter must be in upper case</li>
    <li>Surname: Must have no leading or trailing spaces - First letter must be in upper case</li>
    <li>Gender: The gender must be inferred from the Title</li>
    <li><b>Salary</b>: Assuming that the salary column is the gross salary</li>
    <li><b>Tax Deductions</b>: See process in cell below</li>
</ul>
Save the newly retrieved data into an excel sheet. Hint: Use Pandas export.

<b>Tax Brackets</b>

Annual Tax: 

0% on income up to the tax threshold<br/>
18% on income between the threshold and R205,900<br/>
26% on income between R205,901 and R321,600<br/>
31% on income between R321,601 and R445,100<br/>
36% on income between R445,101 and R584,200<br/>
39% on income between R584,201 and R744,800<br/>
41% on income between R744,801 and R1,577,300<br/>
45% on income above R1,577,301<br/>

Annual Tax Rebate: R14958<br/>
Annual Tax Threshold: R87300

<b>Example</b>
<p style="color:blue">Assumptions:</p>

Monthly salary: R25,000
Age: Under 65 years old
No additional deductions or credits for simplicity
Determine the Taxable Income:

<p style="color:blue">Apply Tax Threshold:</p>

Monthly threshold: R87,300 / 12 = R7,275
If the monthly income is below this threshold, there is no income tax payable. In this example, R25,000 > R7,275.

<p style="color:blue">Apply Tax Brackets:</p>

The portion of income up to R205,900 is taxed at 18%.
The portion of income between R205,901 and R321,600 is taxed at 26%.
In this example, the entire income falls within the first bracket (18%).

<p style="color:blue">Tax Calculations:</p>

Tax on the portion of income in the first bracket: R25,000 * 18% = R4,500
Determine Rebates:

<p style="color:blue">Apply Tax Rebate:</p>

Monthly rebate: R14,958 / 12 = R1,246.50

Subtract the rebate from the tax calculated:

Net Tax: R4,500 - R1,246.50 = <b style="color:red">R3,253.50</b>

<b>Question 3</b><br/><br/>
Given the Students Table in the Students database, generate a result set with the following columns and requirements:
<ul>
    <li>Name: Must have not leading or trailing space - First letter must be in upper case</li>
    <li>Surname: Must have no leading or trailing spaces - First letter must be in upper case</li>
    <li><b>IDNumber</b>: Remove any spurious symbol and keep only records with valid SAID Numbers</li>
    <li><b>BirthDay</b>: Derive from the ID Number</li>
    <li><b>BirthMonth</b>: Derive from the ID Number</li>
    <li><b>BirthYear</b>: Derive from the ID Number</li>
    <li><b>Gender</b>: Derive from the ID Number</li>
    <li><b>Citizenship</b>: Derive from ID number (SA citizen or Permanent resident)</li>
</ul>

Save the newly retrieved data into an excel sheet. Hint: Use Pandas export.

<img src="../media/sa_id.png" width="500px"/>

In [5]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%%sql
sqlite:///my_staff_db.db

In [10]:
%%sql

DROP TABLE IF EXISTS staff;

-- Create the staff table
CREATE TABLE staff (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    surname TEXT NOT NULL,
    age INTEGER,
    salary REAL,
    education TEXT
);

-- Insert dummy data with spurious and outlier values into the staff table
INSERT INTO staff (name, surname, age, salary, education) VALUES
    ('John', 'Doe', 35, 450000, 'Undergrad'),
    ('Jane', 'Smith', 40, 550000, 'Postgrad'),
    ('Alice', 'Johnson', 28, 320000, 'High School'),
    ('Bob', 'Williams', 45, 500000, 'Undergrad'),
    ('Chris', 'Brown', 32, 420000, 'Postgrad'),
    -- Add more records with realistic data...

    -- Add spurious data with missing fields and outliers
    ('Chris', 'Taylor', 30, 480000, 'Undergrad'),
    ('David', 'Copperfield', 26, 370000, 'Postgrad'),
    ('Emma', 'Johnson', NULL, 520000, 'High School'),
    ('Frank', 'White', 55, NULL, 'Postgrad'),
    ('Grace', 'Davis', 40, 6000000, 'Undergrad'),
    ('Henry', 'Brown', 160, 480000, 'Pandas'),  -- Education outlier
    -- Add more spurious data...

    -- Insert more realistic data
    ('Isaac', 'Miller', 30, 420000, 'High School'),
    ('Jessica', 'Clark', 38, 480000, 'Undergrad'),
    ('Kevin', 'Taylor', 45, 550000, 'Postgrad'),
    -- Add more records...

    -- Insert more spurious data
    ('Herve', 'Anderson', NULL, 520000, NULL),
    ('Lily', 'Hill', 29, NULL, 'High School'),
    ('Mike', 'Jackson', 58, 9000000, 'Undergrad'),
    -- Add more spurious data...

    -- Insert more realistic data
    ('Nancy', 'Thomas', 42, 580000, 'Postgrad'),
    ('Oscar', 'Wilson', 27, 330000, 'High School'),
    ('Paul', 'Harris', 35, 490000, 'Undergrad');
    -- Add more records...

 * sqlite:///my_staff_db.db
   sqlite:///staff_db.db
Done.
Done.
Done.
0 rows affected.

[]

<b>Question 4</b><br/>

4.1 Given the table staff (id, name, surname, age, salary, education) 
of my_staff_db database: 
 <ul>
    <li>How many records have missing values?</li>
     <li>How many records have data with spurious values (i.e outliers)?</li>
  </ul>
    
4.2 Generate a result set that contains data records with all missing values replaced.
<ul>
 <li>Only replace missing values where the data recors contain at most one missing field</li>
 <li>Identify and mark outliers and fill them in appropriately when relevant</li>
</ul>

4.3. The result set must have an additional column called <b>is_flagged</b> that contains 1 for flagged (i.e containing outliers) 
records and 0 otherwise.

4.4. Export your result to an Excel sheet.

In [11]:
%%sql
SELECT * FROM staff

 * sqlite:///my_staff_db.db
   sqlite:///staff_db.db
Done.

[(1, 'John', 'Doe', 35, 450000.0, 'Undergrad'),
 (2, 'Jane', 'Smith', 40, 550000.0, 'Postgrad'),
 (3, 'Alice', 'Johnson', 28, 320000.0, 'High School'),
 (4, 'Bob', 'Williams', 45, 500000.0, 'Undergrad'),
 (5, 'Chris', 'Brown', 32, 420000.0, 'Postgrad'),
 (6, 'Chris', 'Taylor', 30, 480000.0, 'Undergrad'),
 (7, 'David', 'Copperfield', 26, 370000.0, 'Postgrad'),
 (8, 'Emma', 'Johnson', None, 520000.0, 'High School'),
 (9, 'Frank', 'White', 55, None, 'Postgrad'),
 (10, 'Grace', 'Davis', 40, 6000000.0, 'Undergrad'),
 (11, 'Henry', 'Brown', 160, 480000.0, 'Pandas'),
 (12, 'Isaac', 'Miller', 30, 420000.0, 'High School'),
 (13, 'Jessica', 'Clark', 38, 480000.0, 'Undergrad'),
 (14, 'Kevin', 'Taylor', 45, 550000.0, 'Postgrad'),
 (15, 'Herve', 'Anderson', None, 520000.0, None),
 (16, 'Lily', 'Hill', 29, None, 'High School'),
 (17, 'Mike', 'Jackson', 58, 9000000.0, 'Undergrad'),
 (18, 'Nancy', 'Thomas', 42, 580000.0, 'Postgrad'),
 (19, 'Oscar', 'Wilson', 27, 330000.0, 'High School'),
 (20, 'Paul', 'Harris', 35, 490000.0, 'Undergrad')]